Tekla Open API Reference for Tekla Structures 2025
AnalysisModelJobProperties.PartNumber Property
 The number of the part.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string PartNumber { get; set; }
Public Property PartNumber As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnalysisModelJobProperties Class
Tekla.Structures.Analysis Namespace